## Co to jest Pandas?

Pandas to biblioteka open-source, która dostarcza łatwe w użyciu struktury danych oraz narzędzia do analizy danych. Dwie główne struktury danych w Pandas to Series i DataFrame.

- Series to jednowymiarowa tablica z etykietami.
- DataFrame to dwuwymiarowa tablica (coś jak tabela w Excelu), gdzie kolumny mogą mieć różne typy danych.

### Instalacja

Ponieważ korzystamy z Anacondy i Jupyter Notebooka główne analityczne biblioteki mamy w pakiecie

## Tworzenie Series

Series to jednowymiarowa struktura danych. Oto jak możemy stworzyć Series z listy:

Konwencją jest używanie aliasu pd dla Pandas przy imporcie, co sprawia, że kod jest bardziej czytelny i zwięzły.

In [5]:
import pandas as pd

data = [1, 2, 3, 4, 5]
series = pd.Series(data)

series

0    1
1    2
2    3
3    4
4    5
dtype: int64

## Tworzenie DataFrame

DataFrame to dwuwymiarowa struktura danych. Możemy stworzyć DataFrame z wielu źródeł danych, takich jak słownik list. Inną opcją jest import danych, ale o tym w jednej z kolejnych lekcji.

In [6]:
data = {
'Name' : ['John', 'Anna', 'Stanislaus','Cristof'],
'Age':[28, 30, 20, 50]
}

df=pd.DataFrame(data)
df

         Name  Age
0        John   28
1        Anna   30
2  Stanislaus   20
3     Cristof   50

### Podstawowe operacje na DataFrame

In [8]:
df.head(2)

   Name  Age
0  John   28
1  Anna   30

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
dtypes: int64(1), object(1)
memory usage: 196.0+ bytes

In [10]:
df.describe()

             Age
count   4.000000
mean   32.000000
std    12.754084
min    20.000000
25%    26.000000
50%    29.000000
75%    35.000000
max    50.000000